### queries(MySql)

some basic queries execution by using mysql.connector

In [1]:
import mysql.connector

In [2]:
mydb=mysql.connector.connect(host="localhost",user="roja",passwd="nani",database="department")
db=mydb.cursor()

Print all students names

In [3]:
db.execute("select first_name,last_name from student")
for i in db:
    print(i[0]+'.'+i[1])

roja.mogili
naren.vallepu
prakash.mogili
lally.mogili

print all student details whose name end with vowel

In [4]:
db.execute("select * from student where right(first_name,1) in ('a','e','i','o','u')")
print("id","first_name","last_name","gender","DOB","\t"+"branch","Join_date",sep="\t")
print("----------------------------------------------------------------------------------")
for i in db:
    print(i[0],i[1]+"\t",i[2]+"\t",i[3],i[4],i[5],i[6],sep="\t")

id	first_name	last_name	gender	DOB		branch	Join_date
----------------------------------------------------------------------------------
1	roja		mogili		F	1999-08-18	CSE	2016-06-01

print all student details whose name doesnot start with vowel

In [5]:
db.execute("select * from student where left(first_name,1) not in ('a','e','i','o','u')")
print("id","first_name","last_name","gender","DOB","\t"+"branch","Join_date",sep="\t")
print("----------------------------------------------------------------------------------")
for i in db:
    print(i[0],i[1]+"\t",i[2]+"\t",i[3],i[4],i[5],i[6],sep="\t")

id	first_name	last_name	gender	DOB		branch	Join_date
----------------------------------------------------------------------------------
1	roja		mogili		F	1999-08-18	CSE	2016-06-01
2	naren		vallepu		M	1997-11-10	ECE	2016-08-01
3	prakash		mogili		M	2000-08-08	Civil	2018-06-01
4	lally		mogili		F	1998-08-18	CSE	2015-06-01

display how many students data existed in student table

In [8]:
db.execute("select count(id) from student")
for i in db:
    print(i[0])

4

Add a column name "fee" which is used to show how much money student have to pay

In [4]:
db.execute("alter table student add fee int(12)")
mydb.commit()
db.execute("show columns from student")
for i in db:
    print(i)

('id', 'int(12)', 'NO', 'PRI', None, 'auto_increment')
('first_name', 'varchar(20)', 'NO', '', None, '')
('last_name', 'varchar(20)', 'NO', '', None, '')
('gender', "enum('M','F')", 'NO', '', None, '')
('DOB', 'date', 'NO', '', None, '')
('branch_name', 'varchar(120)', 'NO', '', None, '')
('join_date', 'date', 'YES', '', None, '')
('fee', 'int(12)', 'YES', '', None, '')

id        fee

1         20000

2         15000

3         41400

4         12500

enter the fee values as shown above

In [6]:
db.execute("update student set fee=20000 where id=1")
db.execute("update student set fee=15000 where id=2")
db.execute("update student set fee=41400 where id=3")
db.execute("update student set fee=12500 where id=4")
mydb.commit()

db.execute("select * from student")
print("id","first_name","last_name","gender","DOB","\t"+"branch","Join_date","fee",sep="\t")
print("-------------------------------------------------------------------------------------------")
for i in db:
    print(i[0],i[1]+"\t",i[2]+"\t",i[3],i[4],i[5],i[6],i[7],sep="\t")

id	first_name	last_name	gender	DOB		branch	Join_date	fee
-------------------------------------------------------------------------------------------
1	roja		mogili		F	1999-08-18	CSE	2016-06-01	20000
2	naren		vallepu		M	1997-11-10	ECE	2016-08-01	15000
3	prakash		mogili		M	2000-08-08	Civil	2018-06-01	41400
4	lally		mogili		F	1998-08-18	CSE	2015-06-01	12500

how much money students have to pay

In [8]:
db.execute("select sum(fee) from student")
for i in db:
    print(i[0])

88900